<template>
    <div class="info__holder">
        <h1>Информация по разделу ошибки</h1>
        <!-- <p>В данном разделе вы видите все т</p> -->
        <h2>Остновная концепция</h2>
        <br>
        <h4>Добавление ошибки по проекту разделено на три этапа</h4>
        <table>
            <tr style="border: solid 2px orange">
                <th>№</th>
                <th class="vertical">Этап</th>
                <th>Описание</th>
                <th class="vertical">Статус</th>
                <th class="vertical">Выполняет</th>
            </tr>
            <tr>
                <td>1</td>
                <td class="vertical">Добавление </td>
                <td class="table__desc">СЭМ выбирает тип ошибки, описывает замечание, и при необходимости добавляет фотографии.</td>
                <td class="vertical">Открыто</td>
                <td class="vertical">СЭМ</td>
            </tr>
            <tr>
                <td>2</td>
                <td class="vertical">Решение </td>
                <td class="table__desc">Если ошибка связана с документацией, мастер совместно с проектировщиком принимают решение по ошибке,
                    при необходимости инженер вносит исправления в документацию.
                    <br> Если ошибка связана с отсутствием комплектации, перед отгрузкой необходимо согласование ПМ.
                </td>
                <td class="vertical">Приянто</td>
                <td class="vertical">Мастер</td>
            </tr>
            <tr>
                <td>3</td>
                <td class="vertical">Устранение </td>
                <td class="table__desc">СЭМ устраняет ошибку согласно принятому решению, и при необходимости указывает время на устранение.
                </td>
                <td class="vertical">Закрыто</td>
                <td class="vertical">СЭМ</td>
            </tr>
        </table>
<div class="info">
            <p>В разделе "Ошибки" вы видите карточки всех замечаний со статусом "Открыто" или "Принято". Кликнув по карточке, вы перейдёте на страницу редактирования.
            <br>
        &#10040;  Ошибки со статусом "Открыто" может редактировать только тот, кто добавил данное замечание (автор), <br>
        &#10040; Замечания со статусом "Принято" может закрыть любой СЭМ.
        </p>
        <br>
        <h2>Добавление ошибки</h2>
        <br>
        <h4>Для добавления нажмите на кнопку в правом нижнем углу экрана</h4>
        <br>
        <img class="add__button" src="/img/add.svg" alt="Добавить новую ошибку">
        <br>
        <p>Далее, выберите <br>&#10040; номер проекта <br>&#10040; название шкафа <br> 
        
       <q>Для удобства доступен поиск, начните вводить номер проекта, название шкафа, или номер WO.</q> <br><br>
       Выберите тип ошибки:
       <br>&#10040; Материалы - <q>Несоответствие количества оборудования например: документация (Внешний вид) и спецификация, или спецификация и WO. <br>
       Перед сдачей на тестирование записывается всё невыданное оборудование</q>
       <br>&#10040; ПД электрическая схема - <q>Замечание по маркировке, сечению проводов, ошибках в схеме и.т.д.</q>
       <br>&#10040; ПД конструктив - <q>Отсутствие размеров, невозможность впихнуть невпихуемое, и.т.д</q>
        <br>
       <br>&#10040; По возможности кратко и доступно опишите замечание, что куда где и как.
       <br>&#10040; Для удобства восприятия добавте фотографию, для этого нажмите на кнопку
<br></p>
        <img class="add__button" src="/img/add__image.svg" alt="add photo">
       <p>Выберете нужный файл, или сделайте фотографию. <br>
       <br>&#10040; В завершении нажмите кнопку добавить, дождитель добавления ошибки в базу данных, после этого вас автоматически перенапрвит на страницу "Текущие ошибки по шкафам".
       <br>Вы великолепны!</p>
       <br>
       <br>
       <br>
       <br>
</div>

    </div>
</template>

<script setup>

</script>

<style lang="css" scoped>
.info__holder{
width: min(900px, 95vw);
margin: auto;
}
.add__button{
    width: 40px;
    height: 40px;
}
.info{
     
     
}
.info>p{
    text-align: start;
    line-height: 1.5;
}
table {
    width: 100%;
  margin:2vh auto;
  border-collapse: collapse;
  border-radius: 5px;
}
td,
th {
  border: 1px solid #999;
  padding: 0.5rem;
}
td{
      font-size: max(12px, 12px + 0.1vw);
}
.table__desc{
  text-align: start;

}
tbody tr:nth-child(odd) {
  background: #eee;
}
tbody tr:hover {
  background: rgb(255, 238, 192);
}
@media only screen and (max-width: 600px) {
    .vertical{
   writing-mode: tb-rl;
        transform: rotate(-180deg);
}
}


</style>